Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.mcp.agentSetup.pair.agent.copy
source: Copy Agent Prompt
ar: نسخ مطالبة الوكيل
de: Agent-Prompt kopieren
es: Copiar indicación para agente
fr: Copier l'invite pour l'agent
id: Salin Prompt Agen
it: Copia prompt agente
ja: エージェントプロンプトをコピー
ko: 에이전트 프롬프트 복사
nl: Agentprompt kopiëren
pl: Kopiuj prompt agenta
pt_br: Copiar Comando do Agente
ru: Копировать запрос для агента
tr: Aracı İstemini Kopyala
uk: Копіювати запит для агента
vi: Sao chép lời nhắc tác nhân
zh_hans: 复制 Agent Prompt
zh_hant: 複製 Agent Prompt

# settings.mcp.agentSetup.pair.agent.help
source: Give an AI agent a five-minute, single-use pairing command and wait for approval in Starcat.
ar: امنح وكيل الذكاء الاصطناعي أمر اقتران للاستخدام مرة واحدة لمدة خمس دقائق وانتظر الموافقة في Starcat.
de: Geben Sie einem KI-Agenten einen fünfminütigen, einmaligen Pairing-Befehl und warten Sie auf die Genehmigung in Starcat.
es: Dale a un agente de IA un comando de emparejamiento de un solo uso de cinco minutos y espera la aprobación en Starcat.
fr: Donnez à un agent IA une commande d'appairage à usage unique de cinq minutes et attendez l'approbation dans Starcat.
id: Berikan agen AI perintah pemasangan sekali pakai selama lima menit dan tunggu persetujuan di Starcat.
it: Fornisci a un agente AI un comando di abbinamento monouso di cinque minuti e attendi l'approvazione in Starcat.
ja: AIエージェントに5分間有効な使い捨てのペアリングコマンドを渡し、Starcatでの承認を待ちます。
ko: AI 에이전트에게 5분 동안 유효한 일회용 페어링 명령을 제공하고 Starcat에서 승인을 기다리세요.
nl: Geef een AI-agent een eenmalige koppelingsopdracht van vijf minuten en wacht op goedkeuring in Starcat.
pl: Przekaż agentowi AI jednorazowe polecenie parowania ważne pięć minut i poczekaj na zatwierdzenie w Starcat.
pt_br: Forneça a um agente de IA um comando de emparelhamento de uso único de cinco minutos e aguarde a aprovação no Starcat.
ru: Дайте ИИ-агенту одноразовую команду сопряжения на пять минут и дождитесь подтверждения в Starcat.
tr: Bir yapay zeka aracısına beş dakikalık, tek kullanımlık bir eşleme komutu verin ve Starcat'ta onay bekleyin.
uk: Надайте AI-агенту одноразову команду сполучення на п'ять хвилин і зачекайте підтвердження в Starcat.
vi: Cung cấp cho tác nhân AI lệnh ghép nối dùng một lần trong năm phút và chờ phê duyệt trong Starcat.
zh_hans: 向 AI Agent 提供五分钟、单次有效的配对命令，并等待在 Starcat 中确认设备。
zh_hant: 向 AI Agent 提供五分鐘、單次有效的配對命令，並等待在 Starcat 中確認裝置。

# settings.mcp.agentSetup.pair.agent.title
source: Pair with an AI Agent
ar: الاقتران باستخدام وكيل ذكاء اصطناعي
de: Mit einem KI-Agenten paaren
es: Emparejar con un agente de IA
fr: Appairer avec un agent IA
id: Pasangkan dengan Agen AI
it: Abbina con un agente AI
ja: AIエージェントとペアリング
ko: AI 에이전트와 페어링
nl: Koppelen met een AI-agent
pl: Sparuj z agentem AI
pt_br: Emparelhar com um Agente de IA
ru: Сопряжение через ИИ-агента
tr: Bir Yapay Zeka Aracısı ile Eşle
uk: Сполучити за допомогою AI-агента
vi: Ghép nối với tác nhân AI
zh_hans: 使用 AI Agent 配对
zh_hant: 與 AI Agent 配對

# settings.mcp.agentSetup.pair.manual.copy
source: Copy Pairing Command
ar: نسخ أمر الاقتران
de: Pairing-Befehl kopieren
es: Copiar comando de emparejamiento
fr: Copier la commande d'appairage
id: Salin Perintah Pemasangan
it: Copia comando di abbinamento
ja: ペアリングコマンドをコピー
ko: 페어링 명령 복사
nl: Koppelingsopdracht kopiëren
pl: Kopiuj polecenie parowania
pt_br: Copiar Comando de Emparelhamento
ru: Копировать команду сопряжения
tr: Eşleme Komutunu Kopyala
uk: Копіювати команду сполучення
vi: Sao chép lệnh ghép nối
zh_hans: 复制配对命令
zh_hant: 複製配對命令

# settings.mcp.agentSetup.pair.manual.help
source: Copy the complete pairing command, paste it into the target device's terminal, press Enter, then approve the device in Starcat. The command expires after five minutes and works only once.
ar: انسخ أمر الاقتران الكامل، والصقه في طرفية الجهاز المستهدف، واضغط Enter، ثم وافق على الجهاز في Starcat. ينتهي الأمر بعد خمس دقائق ويعمل مرة واحدة فقط.
de: Kopieren Sie den vollständigen Pairing-Befehl, fügen Sie ihn in das Terminal des Zielgeräts ein, drücken Sie die Eingabetaste und genehmigen Sie dann das Gerät in Starcat. Der Befehl läuft nach fünf Minuten ab und funktioniert nur einmal.
es: Copia el comando de emparejamiento completo, pégalo en la terminal del dispositivo de destino, presiona Enter y luego aprueba el dispositivo en Starcat. El comando caduca después de cinco minutos y funciona solo una vez.
fr: Copiez la commande d'appairage complète, collez-la dans le terminal de l'appareil cible, appuyez sur Entrée, puis approuvez l'appareil dans Starcat. La commande expire après cinq minutes et ne fonctionne qu'une seule fois.
id: Salin perintah pemasangan lengkap, tempelkan ke terminal perangkat target, tekan Enter, lalu setujui perangkat di Starcat. Perintah kedaluwarsa setelah lima menit dan hanya berfungsi sekali.
it: Copia il comando di abbinamento completo, incollalo nel terminale del dispositivo di destinazione, premi Invio, quindi approva il dispositivo in Starcat. Il comando scade dopo cinque minuti e funziona una sola volta.
ja: 完全なペアリングコマンドをコピーし、対象デバイスのターミナルに貼り付けてEnterキーを押し、Starcatでデバイスを承認してください。コマンドは5分で期限切れとなり、1回のみ使用できます。
ko: 완전한 페어링 명령을 복사하여 대상 장치의 터미널에 붙여넣고 Enter를 누른 다음 Starcat에서 장치를 승인하세요. 명령은 5분 후에 만료되며 한 번만 사용할 수 있습니다.
nl: Kopieer de volledige koppelingsopdracht, plak deze in de terminal van het doelapparaat, druk op Enter en keur het apparaat vervolgens goed in Starcat. De opdracht verloopt na vijf minuten en werkt slechts één keer.
pl: Skopiuj kompletne polecenie parowania, wklej je w terminalu urządzenia docelowego, naciśnij Enter, a następnie zatwierdź urządzenie w Starcat. Polecenie wygasa po pięciu minutach i działa tylko raz.
pt_br: Copie o comando de emparelhamento completo, cole-o no terminal do dispositivo de destino, pressione Enter e aprove o dispositivo no Starcat. O comando expira após cinco minutos e funciona apenas uma vez.
ru: Скопируйте полную команду сопряжения, вставьте её в терминал целевого устройства, нажмите Enter, затем подтвердите устройство в Starcat. Команда действует пять минут и работает только один раз.
tr: Tam eşleme komutunu kopyalayın, hedef cihazın terminaline yapıştırın, Enter'a basın, ardından Starcat'ta cihazı onaylayın. Komut beş dakika sonra geçerliliğini yitirir ve yalnızca bir kez çalışır.
uk: Скопіюйте повну команду сполучення, вставте її в термінал цільового пристрою, натисніть Enter, потім підтвердьте пристрій у Starcat. Команда дійсна п'ять хвилин і працює лише один раз.
vi: Sao chép lệnh ghép nối hoàn chỉnh, dán vào terminal của thiết bị đích, nhấn Enter, sau đó phê duyệt thiết bị trong Starcat. Lệnh hết hạn sau năm phút và chỉ hoạt động một lần.
zh_hans: 复制完整配对命令，在目标设备的终端中粘贴并按回车，然后回到 Starcat 确认设备。命令五分钟内有效且只能使用一次。
zh_hant: 複製完整配對命令，在目標裝置的終端機中貼上並按 Enter，然後回到 Starcat 確認裝置。命令五分鐘內有效且只能使用一次。

# settings.mcp.agentSetup.pair.manual.title
source: Pair manually
ar: الاقتران يدويًا
de: Manuell paaren
es: Emparejar manualmente
fr: Appairer manuellement
id: Pasangkan secara manual
it: Abbina manualmente
ja: 手動でペアリング
ko: 수동으로 페어링
nl: Handmatig koppelen
pl: Sparuj ręcznie
pt_br: Emparelhar manualmente
ru: Сопряжение вручную
tr: Manuel eşle
uk: Сполучити вручну
vi: Ghép nối thủ công
zh_hans: 手动配对
zh_hant: 手動配對

# settings.mcp.agentSetup.pair.title
source: Pair a device
ar: اقتران جهاز
de: Gerät paaren
es: Emparejar un dispositivo
fr: Appairer un appareil
id: Pasangkan perangkat
it: Abbina un dispositivo
ja: デバイスをペアリング
ko: 장치 페어링
nl: Een apparaat koppelen
pl: Sparuj urządzenie
pt_br: Emparelhar um dispositivo
ru: Сопряжение устройства
tr: Bir cihazı eşle
uk: Сполучити пристрій
vi: Ghép nối thiết bị
zh_hans: 配对设备
zh_hant: 配對裝置
